package com.netease.easyml.common.util;

import org.junit.Test;

import java.util.List;

/**
 * Created by linjiuning on 2020/12/2.
 */
public class StringUtilTest {

    @Test
    public void strip() {
        String text = "  \ta a";
        String strip = StringUtil.strip(text);
        System.out.println(strip);
    }

    @Test
    public void splitSentence() {
        String text = "1d513be6_1cc2363f1\t真相是真后续的后续 时间线接深渊四之后，部分接现实，Gr成员大换血，爱丽加入狼队（来自真的是蓝胖不咕倒立吃糠的怨念，这瓜娃子又咕直播） 私设保研学霸狗 请勿上升真人 都是我编的 以上 ———————————— 　　【以后就是小狼狗了。】 　　蓝胖子新发的朋友圈配图是Alex晚上直播截图，应该是部分可见，点赞只有熟悉他们关系的几个朋友，还有姐姐。 　　Alex盯着屏幕愣了足有一分钟，无他，朋友圈定位在本市。 　　直播间活动接近尾声，算过时间还能赶上最晚班公交，Alex借口收拾东西匆匆下播。 　　“你过来了？” 　　“你怎么知道的？”蓝胖子惊讶。 　　“下次想干坏事先记得关定位。” 　　拉起行李箱，Alex本来还犹豫明天几点起床赶动车，现在不用了，蓝胖子住的酒店就离车站不远。 　　那边挂断电话蓝胖子开始点外卖，跨平台娱乐赛从下午一直持续到晚上，接着就是直播间活动，以他对Alex的了解小朋友现在肯定饿了，而且肯定会来找他。 　　Alex和外卖是一起到的。 　　蓝胖子拎着外卖，电梯门正缓缓合上，突然又打开，他男朋友拖着行李箱挤进来。 　　“你过来怎么不说一声？”Alex有些嗔怪。 　　“这不是想给你个惊喜么。” 　　蓝胖子眨眨眼睛，虽然距上次见面还不到一个月，他已经非常想念他。 　　“这叫惊喜？明明是惊吓？”Alex碎碎念。 　　“如果不是你忘关定位我们就要错过一晚上！” 　　电梯刚好到楼层，拖着箱子走在蓝胖子身侧，外卖的香味勾起饥饿感，小屠皇撇嘴，蓝胖子绝对是故意的！ 　　“不是去云南？” 　　“事情办完回来有几天了，一看你就是不关心我！都不知道我什么时候回来！” 　　假装生气去捏Alex脸颊，两人推推搡搡进了房间。 　　“来来来，先吃饭，你肯定饿了。” 　　行李扔在玄关，Alex洗完手出来正看见蓝胖子在拆塑料袋。 　　“点了什么？” 　　“本来想点小龙虾，你好像有点咳嗽，明天还要去俱乐部报道，就换成粥还有包烧了，管你吃饱好吧。” 　　确实嗓子不舒服的家伙默然，眼睛瞥向另一边没打开袋子外面露出的竹签。 　　“这就是你吃烧烤我喝粥的理由？” 　　“都是你的。”蓝胖子眉眼弯弯。 　　“不跟你抢。” 　　对男朋友美色诱惑并无甚抵抗力的小屠皇有点自闭，先吃饭还是先吃男朋友，这是个问题。 　　 　　填饱肚子已经是夜里十二点，蓝胖子踢着不合脚的一次性拖鞋扔完餐盒回到房间，Alex正趴在床上看行程。 　　“五小时，屁股都要坐裂开。” 　　Alex抱怨道：“到广州多好，少一小时呢。” 　　“还没睡觉你做什么梦？不过夏季赛结束还是要回广州的。”蓝胖子想了想，补充道：“以后你得经常往俱乐部跑，时间调得过来？” 　　“还行，大四没课，我名额下来了，到时候准备下毕业论文就行。” 　　“学霸狗子。” 　　揉乱自家狗子头发，蓝胖子心满意足躺倒。 　　“我刚好去看下皮皮，马克克小沐木都不在了，伍六七又是个不靠谱的，我怕皮皮有情绪。” 　　“嗯，嗯？”Alex慢了半拍才反应过来。 　　“你也去？” 　　“对啊，本来打算明天在车上跟你来个偶遇，哪知道忘关定位，失策失策。” 　　“你怎么知道我车票的？” 　　Alex觉得今天过于迷幻。 　　“你有什么事瞒得过姐姐？” 　　好家伙原来有内奸！Alex此时才明白姐姐祝贺他圆赛场梦时后面跟着那句他最近好事连连的深意。 　　毕竟有个喜欢搞突袭送惊喜（吓）的男朋友，大抵是不可能谈平静的恋爱了。 　　打个小小的饱嗝，忙一整天Alex真有些困了，侧身，顺手揽着蓝胖子的腰把人塞怀里，下巴抵在他肩膀，呼吸间都是蓝胖子惯用那支香水的清淡香味。 　　“不想要个晚安吻？” 　　“别了吧，明天还坐车呢。” 　　停停停！超速了啊！蓝胖子脸热，还是挣扎着翻身给了他男朋友一个吻，吻在脸颊。 　　“晚安。” 　　“嗯，晚安。” 　　灯光暗下去，Alex睡着前想的却是怎么缠蓝胖子在深圳多留几天，顺便明天一定要记得问问战队经理，除了战队训练，平时活动能不能带家属。 　　只想他在身边。";
        List<String> sentences = StringUtil.splitSentenceV2(text, true, false);
        for (String sentence : sentences) {
            System.out.println(sentence);
        }
    }
}