package com.netease.yuanqi.common.utils.model;

import com.fasterxml.jackson.core.JsonProcessingException;
import com.fasterxml.jackson.databind.ObjectMapper;
import java.util.ArrayList;
import java.util.Arrays;
import java.util.HashMap;
import java.util.HashSet;
import java.util.List;
import java.util.Map;
import java.util.Set;
import okhttp3.Headers;

public class CategoryModelContextTool {
    public static final String CONTENT_MODEL_NAME = "qwen3.6-plus";
    public static final String IMG_MODEL_NAME = "qwen3.6-plus";
    public static final double MODEL_TEMPERATURE = 0.1;
    public static final boolean IS_THINKING = false; // 思考模式
    public static final String MODEL_KEY = "sk-9c44f1e5576a4bdc991715f76ec38169";
    public static final String MODEL_URL =
            "https://dashscope.aliyuncs.com/compatible-mode/v1/chat/completions";
    public static final String TITLE_PROMPT =
            "请判断以下标题列表中的标题是否属于一个连载合集的某一集。\n"
                    + "\n"
                    + "**判断依据：**\n"
                    + "1.标题开头/结尾包含表达连载的数字、章节符号（如“第一章”、“第1话”）、连载标志（如“【一】”、“06”、“⑧”、“II”、“⑹”、“Ⅶ”、“㈧”）等。\n"
                    + "2.标题中含有表示时间或顺序的描述性词汇（如“起始篇”、“完结章”、“上/中/下”、“终章”、“完”）等\n"
                    + "3.仅包含数字信息，无任何其他有效信息的标题不属于连载。\n"
                    + "\n"
                    + "**举例：**\n"
                    + "1.标题：【哪吒/敖丙】莲心龙魂 02 结果：{\"result\":\"是\"}\n"
                    + "2.标题：长生殿 结果：{\"result\":\"否\"}\n"
                    + "3.标题：600了！ 结果：{\"result\":\"否\"}\n"
                    + "4.标题：555 结果：{\"result\":\"否\"}\n"
                    + "5.标题 12许三观卖血记 结果：{\"result\":\"是\"}\n"
                    + "\n"
                    + "**返回格式**\n"
                    + "1.严格按照下面json格式返回：\n"
                    + "    {\n"
                    + "    \"result\":\"是/否\"\n"
                    + "    }\n"
                    + "2.禁用Markdown格式\n"
                    + "3.返回数据中不需要使用```json```"
                    + "\n"
                    + "请根据以上规则判断以下标题：";
    public static final String CONTENT_PROMPT =
            "你是一位LOFTER社区管理员，热爱同人文化，请你按照下列类别对文章进行分类。\n"
                    + "\n"
                    + "**分类依据**\n"
                    + "1.连载：这类文章是以虚构叙事为核心，通过情节、人物、环境等文学要素构建的完整或片段式创作，一般连载故事具有以下特征：\n"
                    + "    （1）必须出现明确表示连载的关键词：例如：开头出现“第xx章”、“chapter xx”、文末出现“未完待续”、“敬请期待”等。\n"
                    + "    （2）正文内容为作者原创或二次创作（同人），非真实事件记录；可能包含架空世界观（如奇幻、科幻、ABO设定）。\n"
                    + "    （3）文末任何“暗示或出现故事未完待续”、“出现彩蛋”、“出现隐藏结局”等不明显或具有暗示向的文字均不属于连载！\n"
                    + "2.短篇：这类文章是以虚构叙事为核心，通过情节、人物、环境等文学要素构建的完整或片段式创作。一般短篇故事具有以下特征：\n"
                    + "    （1）正文开头和结尾都没有出现“第xx章”、“chapter xx”、“未完待续”、“敬请期待”等连载标志。\n"
                    + "    （2）正文内容为作者原创或二次创作（同人），非真实事件记录；可能包含架空世界观（如奇幻、科幻、ABO设定）。\n"
                    + "    （3）文末任何“暗示或出现故事未完待续”、“出现彩蛋”、“出现隐藏结局”等属于短篇！\n"
                    + "3.种草：第一类为安利向文章（通过作者的分析为读者进行安利和推荐）；第二类为推文向文章（罗列一系列文章、目录）。这类文章都没有完整叙事线，并不是一篇同人小说。\n"
                    + "    （1）安利向文章的内容是通过作者的体验/分析/解读来向读者推荐或安利某些东西，种草的对象可以是文章/真实物品/人物角色/CP关系等。\n"
                    + "    （2）推文文章的正文内容是一系列文章标题/链接的简单罗列。例如“《文章1》\\n《文章2》\\n《文章3》\\n《文章4》\\n《文章5》\\n《文章6》\\n《文章7》”\n"
                    + "    （3）这些都不属于种草类文章：剧情向小说故事、寻求帮助帖、请求推荐帖、站外引流帖、明显广告等。\n"
                    + "4.创粉沟通：这类文章是作者发布的公告、（更新）说明、灵感记录、个人介绍等，强调作者和粉丝间的互动。一般创粉沟通文章具有以下特征：\n"
                    + "    （1）标题中可能包含“说明”、“通知”、“碎碎念”、“注意”、“预告”等关键词。\n"
                    + "    （2）内容上必须是面向读者粉丝，一般是对粉丝表达：更新说明、文章构思、个人灵感记录、个人介绍、互动沟通等。\n"
                    + "    （3）这些都不属于创粉沟通：日常吐槽、自我碎碎念、无意义文字等\n"
                    + "5.其他：均不符合以上5个类型描述（例如：吐槽贴、金句/语录摘抄、日记随笔、写作攻略等内容描写）\n"
                    + "\n"
                    + "**返回格式**\n"
                    + "1.严格按照下面json格式返回：\n"
                    + "    {\n"
                    + "    \"result\":\"类别\",\n"
                    + "    \"reason\":\"10-15字左右原因\",\n"
                    + "    \"probability\":0-1置信度\n"
                    + "    }\n"
                    + "2.禁用Markdown格式\n"
                    + "3.返回数据中不需要使用```json```\n";

    public static final String IMG_PROMPT =
            "请你根据我的判断依据对图像进行类别判断，可以通过标签内容进行辅助判断。\n"
                    + "\n"
                    + "# 判断依据\n"
                    + "1.memes：是网络爆梗图，通过模板+文字形式来引发互联网传播，图像的核心内容是表达一个IP/网络梗（例如：迷惑行为大赏、真香定律、退退退、黑人抬棺等），通过用幽默、荒诞的表现形式引发群体共鸣。\n"
                    + "    标签：可能包含沙雕、搞笑、梗图、搞笑图片、搞笑日常、梗、填表、填表格、填表挑战等；\n"
                    + "    图像特点：构图简单直接，常为中心对称或上下分层；一般以文字为核心，并且文字幽默；画面常用粗糙截图、低分辨率素材；常用简单轮廓线条或直接使用现实照片；风格混杂（可能结合卡通、真人、3d渲染等）。\n"
                    + "2.插画：整个画面都是制作精良的绘画类型作品。\n"
                    + "    标签：可能包含插画、手绘、板绘、指绘、水彩、水粉、素描等；\n"
                    + "    图像特点为：构图精心设计，一般没有文字；画面高完成度，内容充满整个画面，可能包含复杂光影、纹理、层次，一般插画占据主体，留白较少。\n"
                    + "3.漫画：具有叙述性的多格/多段绘画类型作品。\n"
                    + "    标签：可能包含漫画、条漫、国漫、韩漫等；\n"
                    + "    图像特点为：必须包含多幅连续画面构成叙事，包含分镜、对白等漫画元素；\n"
                    + "4.cosplay：是指通过真人装扮和摄影来扮演动画/漫画/游戏中某个角色的作品，通常以一个真人形象作为画面焦点，包含一到多幅穿戴某个角色假发、衣服、道具的真人演绎照片。\n"
                    + "    标签：可能包含cos、cosplay、cosplay摄影、cosplay正片、cosplay场照等；\n"
                    + "    图像特点：必须为真人装扮、使用道具、假发、角色特色服装进行装扮，cos的对象一般为动画、动漫角色\n"
                    + "5.明星美图：基于真人明星（演员、艺人、视频博主、歌手、偶像）形象配合摄影产生的图片内容。\n"
                    + "    标签：可能包含明星、爱豆、帅哥、美女、演员、明星存图、写真等；标签中一般包含明星姓名。\n"
                    + "    图像特点：图片必须是艺人的半身或全身特写（≥70%画面）\n"
                    + "6.草图：是一种快速、粗略的绘画形式，多为手绘的过程稿和草稿。\n"
                    + "    标签：可能包含草图、手绘、板绘、指绘等；\n"
                    + "    图像特点：结构简单，以手绘线稿为主，带有潦草的辅助线/描边/轮廓线，没有纹理/阴影/渐变等精细部分，通常不会有上色，具有大量留白；\n"
                    + "7.游戏动画截图：来源于游戏/动画视频的内容截屏。\n"
                    + "    标签：可能包含具体的游戏/动画名称，例如（第五人格、闪耀暖暖，秦时明月等）\n"
                    + "    图像特点：图像必须是截图，且非真人，游戏截图中内容一般有HUD（按键/技能/导航栏）设计元素；动画截图下方一般包含字幕，上方包含弹幕，左上/右上很可能包含对应视频平台的logo。\n"
                    + "8.剧照：是表现真人电视剧或电影情节、真人形象的一组照片。\n"
                    + "    标签：可能包含影视、剧照、电视剧、演员、具体的影视名称（例如：《逆爱》、《桃花映江山》）、具体演员名称（李一桐、田栩宁）\n"
                    + "    图像特点：必须是真人图像而不是动画/动漫角色；一般是处于某个场景中的真人特写，具有高度的视觉叙事性和艺术控制性，有时候包含剧名、综艺logo（通常在角落）、或可以推断具体影视IP；往往不包含弹幕等信息。\n"
                    + "9.捡手机：是指通过微信（必须是微信）截图或纯蓝底截图模拟社交媒体对话创作的虚构叙事性图片。\n"
                    + "    标签：可能包含捡手机、捡手机文、捡手机文学等，不包含破次元、破次元恋人相关标签\n"
                    + "    图像特点：必须是微信截图（可能带水印）或纯蓝底背景聊天截图，都是角色扮演+连续对话剧情，仅有一个聊天界面（无评论区/二维码/信件元素）；通过模仿真实聊天记录的方式构建剧情；含气泡框，气泡框的颜色和风格会根据发送者不同而有所区别；\n"
                    + "    特别注意：评论区截图（含作者标志、信件、二维码或链接）绝对不属于捡手机，此类图片应归为\"其他\"\n"
                    + "10.其他：均不符合以上10个类型描述（美景/宠物/美食/手办/谷子照片、纯文字、涂鸦、非捡手机手机截图等）\n"
                    + "\n"
                    + "# 特别注意\n"
                    + "1.优先级声明：当图像特征与标签冲突时，以图像特征为判断依据。\n"
                    + "2.可能会有明星动漫化的插画，但是带有明星的tags。\n"
                    + "3.真人古装照片并不属于cosplay范畴，像电视剧那种真人模样的也不算cosplay。\n"
                    + "4.明星美图和剧照的区别在于：明星美图一般是人物特写，人物画面占比较高(>50%)，而剧照一般是场景+人物，人物画面占比较低。\n"
                    + "5.插画和游戏动画截图的区别在于：插画不能包含相关HUD元素，而游戏动画截图一般都有HUD（返回/继续按键、导航栏）\n"
                    + "6.要区分memes和纯文字内容，纯文字内容往往是小说或者通知，一般不能划分到memes中。\n"
                    + "7.插画和草图的区别是插画会比草图更加精细，草图一般是过程稿和草稿，或者是较为潦草的完整图画/线稿。\n"
                    + "8.评论区、通知、短信、小说片段、平常微信聊天、电子信件截图不能被定义为捡手机，这种应该放到其他类目中；带二维码和链接的不属于捡手机；\n"
                    + "9.置信度标准\n"
                    + "    - 绝对确定 (0.8–1.0)：完全匹配定义，无歧义。\n"
                    + "    - 确定 (0.6–0.8)：基本匹配，轻微模糊。\n"
                    + "    - 不确定 (0–0.6)：无法归类，或多类重叠难区分。\n"
                    + "\n"
                    + "\n"
                    + "# 返回格式\n"
                    + "1.严格按照下面json格式返回：\n"
                    + "    {\n"
                    + "    \"result\":\"类别\",\n"
                    + "    \"reason\":\"10-15字左右原因\",\n"
                    + "    \"probability\":0-1置信度\n"
                    + "    }\n"
                    + "2.禁用Markdown格式\n"
                    + "3.返回数据中不需要使用```json```\n"
                    + "4.务必严格按照json格式返回，不要换成别的格式\n"
                    + "该图像的标签内容为：";
    public static final int RETRY_TIME = 3;

    public static final Set<String> CRAFT_SET =
            new HashSet<>(
                    Arrays.asList(
                            "手账",
                            "diy手工",
                            "古风手帐",
                            "复古拼贴",
                            "纸片托",
                            "拼布手工",
                            "kinbor手帐人生",
                            "活页手帐",
                            "写手帐",
                            "手帐er",
                            "刻纸",
                            "ほぼ日手帐",
                            "创意手工",
                            "拼贴",
                            "奶油胶手机壳",
                            "绕线",
                            "手账记录",
                            "阅读手帐",
                            "软陶作品",
                            "聚丙烯",
                            "刻石",
                            "钩针编织",
                            "手账素材",
                            "火漆印",
                            "手办制作",
                            "魔杖定制",
                            "剪纸",
                            "手工皂",
                            "结绳",
                            "橡皮章雕刻",
                            "古风簪子",
                            "做手作",
                            "手帐教程",
                            "a5手帐",
                            "古风手作",
                            "手工饰品",
                            "手工翻新",
                            "软雕塑",
                            "折纸",
                            "剪纸版画",
                            "扭扭棒",
                            "盐系手帐",
                            "印片",
                            "手工刺绣",
                            "手账分享",
                            "做手帐",
                            "diy",
                            "压花",
                            "树脂土",
                            "手造家",
                            "剪纸画",
                            "手账胶带",
                            "手工皮具",
                            "粘土花",
                            "胶带胶带",
                            "手帐",
                            "掐丝手作",
                            "橡皮章成品",
                            "爱手作",
                            "簪子",
                            "黄浩亮玉雕",
                            "创意手工卫生纸做花",
                            "树脂黏土",
                            "小糖果",
                            "手工",
                            "复古手帐",
                            "纸雕星球",
                            "纸伞",
                            "夕阳红互助学习小组",
                            "手帐链接�梦想一起记录生活",
                            "电子手帐",
                            "盐系拼贴",
                            "lolita配饰",
                            "轻复古手账",
                            "纸藤编织",
                            "四笑手作",
                            "捷克琉璃",
                            "组合碟",
                            "啥也不是的小手工",
                            "diy手工制作",
                            "手帐班",
                            "栗子球",
                            "手工发饰",
                            "树叶拓印",
                            "手作",
                            "古风拼贴",
                            "手工折纸",
                            "纸胶带",
                            "手账拼贴",
                            "黏土",
                            "每日手帐打卡",
                            "手帐拼贴",
                            "小手工",
                            "却扇",
                            "细工花",
                            "灵摆定制",
                            "国风合伙人",
                            "纸飞机",
                            "手工教程",
                            "手作物",
                            "手帐贴纸",
                            "古风发簪",
                            "手帐视频",
                            "手柄支架",
                            "手作集市",
                            "手帐装饰",
                            "手帐术",
                            "每日一章",
                            "手工装订",
                            "手帐生活",
                            "奶油胶手作",
                            "现代折纸",
                            "植物叶脉",
                            "给你看我的手帐吧",
                            "ins手帐",
                            "手工打造",
                            "手工达人",
                            "手工日常",
                            "手账排版",
                            "絮贰贰的手帐生活",
                            "玉簪花",
                            "手帐分享",
                            "手帐日常",
                            "手工设计",
                            "小玩具",
                            "手作市集",
                            "追星手帐",
                            "永生花",
                            "给你看看我的手帐吧",
                            "匠廷艺术",
                            "刺绣",
                            "手工diy",
                            "手帐打卡",
                            "滴胶灵摆",
                            "油漆笔",
                            "折纸设计",
                            "编绳",
                            "发梳",
                            "手帐店",
                            "手工编织",
                            "手作娘",
                            "纸艺",
                            "给你看看我的手账吧",
                            "郭秀丽剪纸",
                            "手帐控",
                            "橡皮章定制",
                            "胶带拼贴",
                            "魔杖",
                            "蜘蛛剪纸",
                            "剪纸艺术",
                            "晒晒我的手帐",
                            "给你看我的手账吧",
                            "不织布",
                            "超轻黏土",
                            "唐宫娃娃",
                            "虎纠手帐",
                            "出簪",
                            "粘土人",
                            "手中世界",
                            "lofter手帐",
                            "手工发簪",
                            "旅行手帐",
                            "双面绣",
                            "棉花",
                            "给你看看我的手账",
                            "手帐排版",
                            "手账本",
                            "橡皮章子",
                            "非遗绒花",
                            "手工艺",
                            "手帐胶带",
                            "定制",
                            "手工耳饰",
                            "让你看看我的手帐",
                            "金属绕线",
                            "大手作家",
                            "lofter手作"));
    public static final Set<String> MEMES_SET =
            new HashSet<>(
                    Arrays.asList(
                            "沙雕", "搞笑", "恶搞", "梗图", "冷笑话", "搞笑图片", "梗图描改", "搞笑日常", "梗", "搞笑短视频",
                            "沙雕日常", "吊图", "迷惑行为大赏", "屌图", "幽默", "迷惑行为", "沙雕向", "奇葩", "搞笑视频", "爆笑",
                            "笑死我了", "魔性", "专治不开心", "社死", "名场面", "搞笑配音", "丝滑玩梗进行时", "娱乐搞笑", "爆笑校园",
                            "桌面短剧"));
    public static final Set<String> NOVAL_SET =
            new HashSet<>(
                    Arrays.asList(
                            "lofter原创短篇",
                            "短篇",
                            "原创女主",
                            "lofter原创小说",
                            "小说原创",
                            "lofter原创",
                            "短篇小说",
                            "耽美原创",
                            "原创作品",
                            "lofter文学社",
                            "元气短篇",
                            "言情",
                            "言情小说",
                            "lofter原创",
                            "lofter故事馆",
                            "lofter原创长篇",
                            "原创小说",
                            "lofter原创文学",
                            "lofter短篇小说"));
    public static final Set<String> COS_SET = new HashSet<>(Arrays.asList("cos", "cosplay"));
    public static final Map<String, String> ERR_TYPE_MAP = new HashMap<>();

    static {
        ERR_TYPE_MAP.put("You have exceeded your request limit", "触发限流");
        ERR_TYPE_MAP.put("Requests rate limit exceeded", "触发限流");
        ERR_TYPE_MAP.put("You exceeded your current requests list", "触发限流");
    }

    public static Headers buildHeaders(String modelKey) {
        return new Headers.Builder()
                .add(
                        "Authorization",
                        modelKey != null && !modelKey.isEmpty() ? modelKey : MODEL_KEY)
                .add("Content-Type", "application/json")
                .build();
    }

    public static String buildBody(
            String modelName, double temperature, Object input, ObjectMapper objectMapper) {
        try {
            Map<String, Object> data = new HashMap<>();
            Map<String, String> outputFormat = new HashMap<>();
            outputFormat.put("type", "json_object");
            List<Object> messages = new ArrayList<>();
            Map<String, Object> message = new HashMap<>();
            messages.add(message);
            message.put("role", "user");
            message.put("content", input);
            data.put("model", modelName);
            data.put("temperature", temperature);
            data.put("enable_thinking", IS_THINKING);
            data.put("response_format", outputFormat);
            data.put("messages", messages);
            return objectMapper.writeValueAsString(data);
        } catch (JsonProcessingException e) {
            return "";
        }
    }

    public static boolean isEmpty(String str) {
        return str == null || str.trim().isEmpty();
    }
}
