package com.netease.easyml.local.mllib.bean;

import java.util.Arrays;
import java.util.HashSet;
import java.util.Set;
import java.util.regex.Pattern;

/**
 * Created by eddielin on 2019/2/28.
 */
public class Constant {

    private static final String[] _NON_INDEPENDENT_FIRST_WORDS = {
            "这里", "但", "这个", "也", "但是", "所以", "还有", "不过", "除了", "虽然",
            "其中", "而且", "同时", "然而", "另外", "此外", "比如", "于是", "后来", "因此",
            "然后", "这种", "可是", "尤其", "却", "接下来", "除此之外", "以上", "甚至", "至于",
            "已经", "以及", "如此", "简直", "包括", "此时", "并且", "仿佛", "随后", "既然",
            "之后", "直到", "那时候", "相比", "也就是说", "总之", "即便", "要说", "而是", "都是",
            "不仅如此", "其次", "例如", "形成", "值得一提的是", "值得", "怎么样", "到底", "实际上", "那时",
            "更是", "继续", "看来", "发现", "不如", "与此同时", "接着", "难道", "对此", "便",
            "比起", "或是", "这时候", "具有", "突然", "而今", "只是", "之所以", "等到", "今后",
            "觉得", "能够", "好在", "顺着", "另一方面", "再次", "只能", "果然", "此后", "应该",
            "不能", "堪称", "犹如", "再也", "难怪", "包含", "不然", "竟然", "此处", "比如说",
            "还要", "与其", "可见", "只不过", "究竟", "光是", "由此", "这边", "可谓", "再说",
            "为何", "说不定", "不仅仅", "更何况", "仅仅", "否则", "依然", "相对于", "考虑到", "以至于",
            "不光", "更加", "说完", "共有", "一不小心", "都能", "才能", "只想", "相当", "完美",
            "带来", "只见", "要么", "最为", "相比之下", "加之", "紧接着", "因而", "使得", "上述",
            "即可", "都有", "一定会", "除此以外", "万一", "更为", "这样一来", "殊不知", "又名", "然鹅",
            "反而", "类似", "除去", "由此可见", "譬如", "怪不得", "尽管如此", "已有", "从而", "促进",
            "出于", "是因为", "另据", "又称", "有望", "分别为", "详见", "于是乎", "要不是", "带给",
            "而后", "相反", "导致", "何况", "换句话说", "意味着", "不愧", "仅限", "久而久之", "避免",
            "感受到", "此情此景", "以此", "堪比", "不好意思", "为此", "其实不然", "莫过于", "再者", "与其说",
            "何必", "无论如何", "仿若", "可能会", "从此以后", "算是", "该段", "隶属于", "但愿", "难以",
            "怎么会", "标志着", "相当于", "仅次于", "果不其然", "抑或", "怎能", "值得一提", "再就是", "引入",
            "绝大部分", "必要", "该片", "可携带", "致使", "气得", "这就是说", "恰恰相反", "胡说", "然则",
            "幸而", "另设", "甚至于", "再继续", "到会", "有损", "再则", "决不能", "逐步完善", "免于",
            "须得", "适宜于", "不得已", "称之为", "如若不然", "乃至于", "依此类推", "譬如说", "谁料", "除此而外",
            "并用", "也怪", "相对而言", "此话", "不亚于", "归功于", "举例来说", "不过如此", "不愧为", "简言之",
            "不用说", "想想也是", "由此看来", "没成想", "不失为", "被迫", "随之而来", "造成了", "以示", "岂能",
            "不足以", "紧跟着", "不至于", "再者说", "有损于", "另请", "远大于", "被占", "反过来说", "察觉到",
            "从那之后", "反之亦然", "以此类推", "常见于", "晋升为", "称为", "助您", "并称", "倒不如", "逐步形成",
            "有助于", "及其", // add by xinfengli
            "它", "它们", "他", "她", "他们", "她们", "其实", "当时", "这", "这些", "确实", "像", "当然", "绝对", "绝对是",
            "不料", "可", "然鹅", "那是", "终于",// add by eddielin
            "还不", "却是", "故", "是", "低于", "以免", "故而", "成为", "又且", "以避免", "或", "最后", "自然",
            "而非", "如", "还能", "高于", "以至", "继而", "进而", "以致", "只有", "通通", "并", "也许", "是其",
            "其", "还", "而", "又确保", "另一边", "前者", "相对", "显然", "能", "或者", "不断", "再", "后者",
            "而其", "使", "故尔", "特别是", "二者"// from lynchtan
    };

    public static final Set<String> NON_INDEPENDENT_FIRST_WORDS = new HashSet<>(Arrays.asList(_NON_INDEPENDENT_FIRST_WORDS));

    // 代词, 连词
    public static final String[] NON_INDEPENDENT_FIRST_POS_PREFIX = {
            "r", "c"
    };

    public static final Pattern SALE_PATTERN = Pattern.compile("([0-9.]+(元|刀|cm|号)|#.+?#|包邮|淘口令|口令|尺码|¥|￥|【.+?】|\\$|优惠|可选|实付|可领|码全|直邮|" +
            "(买.{0,3}送.{0,3}|退货|换货|无忧|货号|此价|以.{0,5}见长))");

    public static final Pattern BLACK_PATTERN = Pattern.compile("(" +
            "^.{1,5}[报网].{1,5}记者.{0,5}$|记者.{0,5}摄$|^图.{0,10}摄$" +
            "|电话.{0,5}\\d+$" +
            "|^.{0,5}视频$" +
            "|^.{0,5}欢迎[观收]看{0,5}$" +
            "|^(主编|编辑)[:：].{0,20}$" +
            "|^.{0,5}网友.{0,10}评论" +
            "|^有奖互动" +
            "|^高清[:：]" +
            "|^记者[:：]" +
            "|^.{0,2}营业时间[:：\\s]" +
            "|^.{0,2}日期[:：\\s]" +
            "|^.{0,2}地址[:：\\s]" +
            "|淘口令" +
            "|\\*.+\\*?" +
            "|\\\\.+(\\\\)?" +
            "|/.+/" +
            "|加.{0,5}(微信号|群)" +
            "|购买链接" +
            "|^\\d月\\d日.{1,5}\\d月\\d日" +
            "|点击.{0,5}购买" +
            ")");

    public static final String[] BLACK_WORDS = {"图片来", "晚上好", "我是", "¥", "|", "早上好", "欢迎来到", "丨", "谢谢", "标星",
            "免费订阅", "改版", "中奖", "奖品", "组队", "星标", "红包", "店铺",
            "蓝字", "原创", "抄袭", "关注", "文字", "编辑", "来源", "转载", "点击", "订阅", "右上角", "视频", "咨询", "导购", "门票",
            "右下角", "阅读原文", "文：", "图：", "图", "ID：", "搜索", "微信公众号", "公众号", "今日头条", "按钮", "收听", "授权转载", "来源于网络", "免费订阅", "合作微信",
            "二维码", "后台回复", "阅读本文", "视频加载", "朋友圈", "充值", "包邮", "淘口令", "上新", "活动解释权", "记者", "中奖",
            "活动规则", "特别声明", "解释权", "温馨提示", "电子码", "今日好店", "广告", "地址", "电话", "预约", "优惠", "套餐"};
    public static final String[] STOP_FLAGS = {"。", "？", "?", "!", "！", "…", "~"};
    public static final String[] NON_STOP_FLAGS = {",", "，", "、", ";", "；", ":", "：", "—", "——"};

    public static final Pattern CLEAN_START_PATTERN = Pattern.compile("^(" +
            "((([引导前][言语读])|观点|原?标题|总结|答|备注|本报讯)[:：])" +
            "|[^a-zA-Z0-9\\u4E00-\\u9FFF\\u3400-\\u4DBF\\uF900-\\uFAFF\"“(（【\\[｢「『《]+" +
            ")");

    public static final Set<String> ALL_PUNCT = new HashSet<>();

    static {
        ALL_PUNCT.addAll(Arrays.asList(STOP_FLAGS));
        ALL_PUNCT.addAll(Arrays.asList(NON_STOP_FLAGS));
    }

    public static final Pattern ZH = Pattern.compile("[a-zA-Z0-9\\u4E00-\\u9FFF\\u3400-\\u4DBF\\uF900-\\uFAFF]");
}
